## Pandas Basic

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ["chandu", "rohan", "skillf", "shubh"],
    "mrks": [92, 34, 24, 17],
    "city": ["pune", "mumbai", "pune", "delhi"]
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  mrks    city
0  chandu    92    pune
1   rohan    34  mumbai
2  skillf    24    pune
3   shubh    17   delhi

In [6]:
df.to_csv('friends.csv')

In [8]:
df.head(2)

     name  mrks    city
0  chandu    92    pune
1   rohan    34  mumbai

In [9]:
df.tail(2)

     name  mrks   city
2  skillf    24   pune
3   shubh    17  delhi

In [10]:
df.describe()

           mrks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [12]:
chandu=pd.read_csv('train.csv')

In [13]:
chandu

   trainNumber  day  charge
0          123   44      55
1          124   45      56
2          125   46      57

In [14]:
chandu['day']

0    44
1    45
2    46
Name: day, dtype: int64

In [15]:
chandu['day'][0]

np.int64(44)

In [16]:
chandu['day'][0]=1

In [17]:
chandu

   trainNumber  day  charge
0          123    1      55
1          124   45      56
2          125   46      57

In [18]:
chandu.to_csv('traininfo.csv')

In [20]:
chandu.index=['a','b','c']

In [21]:
chandu

   trainNumber  day  charge
a          123    1      55
b          124   45      56
c          125   46      57

In [23]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [24]:
newdf.head(5)

          0         1         2         3         4
0  0.203029  0.617154  0.734399  0.802363  0.731189
1  0.786775  0.560183  0.411948  0.989306  0.038772
2  0.959383  0.941963  0.774150  0.730446  0.800773
3  0.684055  0.092027  0.024353  0.596972  0.727520
4  0.602816  0.289626  0.074766  0.835873  0.569318

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [27]:
newdf.loc[0,0]=445

In [29]:
newdf.head(2)

            0         1         2         3         4
0  445.000000  0.617154  0.734399  0.802363  0.731189
1    0.786775  0.560183  0.411948  0.989306  0.038772

In [30]:
newdf.columns=list("ABCDE")

In [31]:
newdf

              A         B         C         D         E
0    445.000000  0.617154  0.734399  0.802363  0.731189
1      0.786775  0.560183  0.411948  0.989306  0.038772
2      0.959383  0.941963  0.774150  0.730446  0.800773
3      0.684055  0.092027  0.024353  0.596972  0.727520
4      0.602816  0.289626  0.074766  0.835873  0.569318
..          ...       ...       ...       ...       ...
329    0.791690  0.469600  0.127058  0.288520  0.084025
330    0.996323  0.508701  0.159143  0.192609  0.064763
331    0.431707  0.830806  0.688690  0.853399  0.216069
332    0.698013  0.283944  0.559755  0.923035  0.025662
333    0.030526  0.842098  0.327051  0.708463  0.080650

[334 rows x 5 columns]

In [32]:
newdf.loc[0,'A']=44

In [33]:
newdf

             A         B         C         D         E
0    44.000000  0.617154  0.734399  0.802363  0.731189
1     0.786775  0.560183  0.411948  0.989306  0.038772
2     0.959383  0.941963  0.774150  0.730446  0.800773
3     0.684055  0.092027  0.024353  0.596972  0.727520
4     0.602816  0.289626  0.074766  0.835873  0.569318
..         ...       ...       ...       ...       ...
329   0.791690  0.469600  0.127058  0.288520  0.084025
330   0.996323  0.508701  0.159143  0.192609  0.064763
331   0.431707  0.830806  0.688690  0.853399  0.216069
332   0.698013  0.283944  0.559755  0.923035  0.025662
333   0.030526  0.842098  0.327051  0.708463  0.080650

[334 rows x 5 columns]

In [36]:
newdf.drop(0,axis=0)

            A         B         C         D         E
1    0.786775  0.560183  0.411948  0.989306  0.038772
2    0.959383  0.941963  0.774150  0.730446  0.800773
3    0.684055  0.092027  0.024353  0.596972  0.727520
4    0.602816  0.289626  0.074766  0.835873  0.569318
5    0.766820  0.509178  0.813694  0.634623  0.457751
..        ...       ...       ...       ...       ...
329  0.791690  0.469600  0.127058  0.288520  0.084025
330  0.996323  0.508701  0.159143  0.192609  0.064763
331  0.431707  0.830806  0.688690  0.853399  0.216069
332  0.698013  0.283944  0.559755  0.923035  0.025662
333  0.030526  0.842098  0.327051  0.708463  0.080650

[333 rows x 5 columns]

In [37]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.411948  0.989306
2  0.774150  0.730446

In [38]:
newdf.head()

           A         B         C         D         E
0  44.000000  0.617154  0.734399  0.802363  0.731189
1   0.786775  0.560183  0.411948  0.989306  0.038772
2   0.959383  0.941963  0.774150  0.730446  0.800773
3   0.684055  0.092027  0.024353  0.596972  0.727520
4   0.602816  0.289626  0.074766  0.835873  0.569318

In [46]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [47]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [48]:
df.dropna(how='all')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [49]:
df.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25